Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
		Given Потребителя отваря страницата за вход в системата
    When Въвежда потребителско име "Иван"
    And Въвежда парола "Pass1234"
    And Натиска върху бутона за вход в системата
    Then Вижда съобщение за успех


 
 Scenario: Вход в системата с невалидни потребителски данни
		Given Потребителя отваря страницата за вход в системата
    When Въвежда потребителско име "Иван12"
    And Въвежда парола "Pass1234567"
    And Натиска върху бутона за вход в системата
    Then Вижда съобщение за грешни данни.
    
