Feature: Избор на оферта 

  Scenario: Закупуване на избрана оферта 
		Given Потребителя отваря страницата за оферти
    When Избира конкретна оферта
    And Натиска бутона за закупуване
    Then Вижда съобщение за успех


 
 Scenario: Неналичност на оферта
		Given Потребителя отваря страницата с оферти
    When Избира конкретна оферта
    And Натиска бутона за закупуване
    Then Вижда съобщение за неналичност на оферта
    
    Scenario: Недостиг на сума
		Given Потребителя отваря страницата с оферти
    When Избира конкретна оферта
    And Натиска бутона за закупуване
    Then Вижда съобщение за неналичност по сметка
    
    Scenario: Изтекла оферта
		Given Потребителя отваря страницата с оферти
    When Избира конкретна оферта
    And Натиска бутона за закупуване
    Then Вижда съобщение, че офертата е изтекла
    
    Scenario: Закупува промоционална оферта
		Given Потребителя отваря страницата с оферти
    When Избира конкретна оферта
    And Натиска бутона за закупуване
    Then Вижда съобщение за успех и получава ваучер с отстъпка
    
